АПК/Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Comment>Все сотрудники Sliva</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Студент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Отделы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Институт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Институты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаСтудента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяИБ</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактныеДанные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Направления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОтчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>52</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

АПК/Catalogs/Сотрудники/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура СтудентПриИзменении(Элемент)
	
	Отказ = Ложь;
	СтандартнаяОбработка = Истина;
	
	Студент = ПриСозданииНаСервере(Отказ, СтандартнаяОбработка);
	
	Если Студент Тогда 
		//ПредупреждениеАсинх("Заполните карточку студента!");
		Сообщить("Заполните карточку студента!");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Студент = Объект.Студент;
	
	Если Студент Тогда 
		Элементы.КарточкаСтудента.Видимость = Истина;
	Иначе 
		Элементы.КарточкаСтудента.Видимость = Ложь;
	КонецЕсли;
	
	Администратор = "Добрынин Андрей Дмитриевич";
	ТекущийПользователь = ПараметрыСеанса.ТекущийСотрудник.Код;
	
	Если РольДоступна("ПолныеПрава") И ТекущийПользователь = Администратор Тогда 
		Элементы.Администрирование.Видимость = Истина;
	Иначе 
		Элементы.Администрирование.Видимость = Ложь;
	КонецЕсли;
	
	Возврат Студент;
	
КонецФункции

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	//Запрос = Новый Запрос;
	//Запрос.Текст =
	//"ВЫБРАТЬ
	//|	Сотрудники.Ссылка КАК Ссылка,
	//|	Сотрудники.Код КАК Код,
	//|	Сотрудники.Отдел КАК Отдел
	//|ИЗ
	//|	Справочник.Сотрудники КАК Сотрудники
	//|ГДЕ
	//|	Сотрудники.Ссылка = &Ссылка
	//|	И Сотрудники.Код = &Код
	//|	И Сотрудники.Отдел = &Отдел";
	//
	//Запрос.УстановитьПараметр("Ссылка", ТекущийОбъект.Ссылка);
	//Запрос.УстановитьПараметр("Код", ТекущийОбъект.Код);
	//Запрос.УстановитьПараметр("Отдел", ТекущийОбъект.Отдел);
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//Если Не РезультатЗапроса.Пустой() Тогда 
	//	
	//	Сообщение = Новый СообщениеПользователю;
	//	Сообщение.Текст = "Такой сотрудник уже существует!";
	//	Сообщение.Сообщить();
	//	
	//	Отказ = Истина;
	//	
	//КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИнститутПриИзмененииНаСервере()
	
	Если Объект.Институт.Наименование = "Институт радиоэлектроники и информационных технологий–РтФ" Тогда 
		Объект.ГруппаСтудента = "РИ-";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИнститутПриИзменении(Элемент)
	ИнститутПриИзмененииНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПослеЗаписиНаСервере()
	// . . .	
КонецФункции

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ПослеЗаписиНаСервере();
	
	//ФормаСписка = Неопределено;
	//ФормаСписка.Обновить();
	
	ЭтаФорма.Закрыть(); // не работает!
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Выборка = Справочники.Сотрудники.Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		
		ПользовательИБ = Неопределено;
		
		ВсеПользователи = ПользователиИнформационнойБазы.ПолучитьПользователей();
		
		Для Каждого Польз Из ВсеПользователи Цикл
			
			Если Польз.ПолноеИмя = СокрЛП(Выборка.Код) Тогда
				
				ПользовательИБ = Польз;
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если ПользовательИБ <> Неопределено Тогда 
			
			СотрудникОбъект = Выборка.ПолучитьОбъект();
			СотрудникОбъект.ИдентификаторПользователяИБ = ПользовательИБ.УникальныйИдентификатор;
			СотрудникОбъект.Записать();
			
		КонецЕсли;
		
	КонецЦикла;		
	
КонецПроцедуры

#КонецОбласти

#Область Команды

&НаСервере
Процедура ДиагностикаНаСервере()
	
	ВсеПользователи = ПользователиИнформационнойБазы.ПолучитьПользователей();
	Для Каждого Польз Из ВсеПользователи Цикл
		Сообщить("Пользователь ИБ: [" + Польз.Имя + "]");
	КонецЦикла;
	
	Сообщить("Код сотрудника: [" + СокрЛП(Объект.Код) + "]");
	
КонецПроцедуры

&НаКлиенте
Процедура Диагностика(Команда)
	ДиагностикаНаСервере();
КонецПроцедуры

#КонецОбласти
